{
  "vladTimofteTitle": "Vlad Timofte",
  "imAProgrammerFromGreece": "I'm a programmer from Greece",
  "home": "Home",
  "aboutTranslating": "About",
  "resumeTranslating": "Resume",
  "servicesTranslating": "Services",
  "portfolioTranslating": "Portfolio",
  "contactTranslating": "Contact",
  "aBitAboutMyself": "A 'bit' about myself",
  "webFrontendDeveloper": "Web Frontend Developer",
  "buildingDigitalWorlds": "Building Digital Worlds, One Line of Code at a Time: A Deep Dive into My Programming Odyssey",
  "birthday": "Birthday",
  "phone": "Phone",
  "city": "City",
  "19June1999": "19 June 1999",
  "oradeaRomania": "Oradea, Romania",
  "age": "Age",
  "degree": "Degree",
  "email": "Email",
  "freelance": "Freelance",
  "bachelors": "Bachelor's",
  "avalaible": "Avalaible",
  "frontendWebDeveloperWithStrongDesireToAchieveMoreAndMore": " Frontend Web Developer with strong desire to achieve more and more. knowledge in javascript, Cascading Style Sheets (CSS), HyperText Markup Language (HTML), Lit Elements, Sass, React, Less, Micro Libraries for App Data State, Bootstrap and Wordpress. Interested fields are RESTful APIs, nodeJS, mongoDB and as more as backend elements/tools for growing my knowledge to a fullstack level.",
  "yearsOfExperience": "Years Of Experience",
  "codeCommits": "Code Commits",
  "bugFixes": "Bug Fixes",
  "daysBeforeCollaboration": "Days Before Collaboration",
  "skillsTranslating": "Skills",
  "romanianLang": "Romanian",
  "greekLanguage": "Greek",
  "englishLanguage": "English",
  "interestsTranslating": "Interests",
  "piano": "Piano",
  "reading": "Reading",
  "traveling": "Traveling",
  "codeLover": "{ Code Lover }",
  "commitedToMyWife": "Commited To My Wife",
  "oneGod": "One God",
  "fishingAndChill": "Fishing & Chill",
  "testimonialsTranslating": "Feedbacks",
  "beautiqFeedback": "What I like most about Vlad is the fact that he is very open to challenges, he is very honest and tells you 'I don't know, but I am informing myself', I appreciate that a lot. He is a professional who wants to perform and evolve. We had a nice collaboration, he explained everything in detail and offered me support whenever I requested it! Thank you and I wish you to make as many beautiful sites as possible!",
  "beautiq": "BeautiQ",
  "ecommerceSite": "E-commerce site",
  "suciuClaudiuFeedBack": "I had the privilege of working with Vlad, an extraordinary Front-End Web Developer. Vlad is a true professional, efficient and dedicated, with exceptional skills in turning ideas into reality. Regardless of the difficulty of the problem, he always finds effective solutions. Vlad is an incredible partner for any project and I highly recommend him to anyone looking for a talented and dedicated Front-End Web Developer.",
  "claudiuSuciu": "Claudiu Suciu",
  "bydb2": "BYDB 2",
  "myResume": "My Resume",
  "education": "Education",
  "universityEmanuelOradea": "University Emanuel Oradea",
  "griffithSchoolManagement": "Griffiths School of Management",
  "shortResumeEmanuelEducation": "Studied at Griffiths School of Management IT, specializing in Information Technology. Gained expertise in software development, IT indstry, database management, network administration, and cybersecurity. Developed strong problem-solving and teamwork skills through collaborative projects.",
  "highSchoolPiraeus": "High school Piraeus",
  "3rdGeneralSchoolPfPiraeus": "3rd General High School of Piraeus, Greece",
  "shortResumeGeneralSchoolPiraeus": "I pursued a dual course of study, delving into the realms of both economics and information technology at the illustrious 3rd General High School of Piraeus in Greece. This unique educational journey provided me with a multifaceted foundation, combining economic insights with the practical skills of IT. As I navigated this academic path, I gained a well-rounded perspective that continues to shape my understanding of the interconnected world of economics and technology.",
  "professionalExperience": "Professional Experience",
  "2023TillPresent": "2023 - Present",
  "2020TillPresent": "2020 - Present",
  "nttDataDetails_1": "Developed and maintained responsive, user-friendly web applications for clients, meeting or exceeding project requirements and deadlines.",
  "nttDataDetails_2": "Collaborated with designers, backend developers, and project managers to ensure seamless integration of design concepts and frontend functionalities.",
  "nttDataDetails_3": "Utilized cutting-edge technologies, including HTML5, CSS3, JavaScript, and frameworks such as Lit Elements, to create interactive and dynamic web interfaces.",
  "nttDataDetails_4": "Actively participated in code reviews, providing constructive feedback to improve code quality and maintain coding standards.",
  "nttDataDetails_5": "Assisted in documenting project requirements and technical specifications.",
  "nttDataDetails_6": "Actively participated in client meetings and translated technical jargon into understandable terms.",
  "wordpressDeveloper": "WordPress Developer",
  "tracknamicDetails_1": "Collaborated with a dynamic team to create user-friendly web interfaces, emphasizing teamwork to deliver outstanding results.",
  "tracknamicDetails_2": "Developed and maintained frontend components using React (HTML - CSS - JS).",
  "tracknamicDetails_3": "Contributed to optimizing web performance, enhancing page load times and elevating user engagement.",
  "tracknamicDetails_4": "Managed and resolved cross-browser compatibility issues, improving website functionality across various platforms and browsers.",
  "wordpressDetails_1": "Translated client requirements into functional and visually appealing web solutions by leveraging the power of WordPress.",
  "wordpressDetails_2": "Developed and customized WordPress websites, ranging from simple informational pages to complex e-commerce platforms, tailoring each project to the unique needs of the client.",
  "wordpressDetails_3": "Implemented and configured WordPress plugins and developed custom themes from skratch.",
  "wordpressDetails_4": "Delivered on-time and within budget, achieving client satisfaction and positive feedback.",
  "myServices": "My Services",
  "wordpressPresentationSite": "Wordpress Presentation Site",
  "649Euro": "649 Euro",
  "customDomainName": "Custom domain name",
  "wordpressBuilt": "Wordpress Built",
  "themeBuiltFromScratch": "Theme built from scratch",
  "variousPluginsPosibility": "Various plugins possibility",
  "colourPalleteAtPrefference": "Colour palette at preference",
  "5pages": "5 Pages",
  "contactForm": "Contact Form",
  "2weeksWork": "2 Weeks Work",
  "bootstrapPresentationSIte": "Bootstrap Presentation Site",
  "499Euro": "499 Euro",
  "bootstrapTheme": "Bootstrap Theme",
  "codeOnly": "Code Only",
  "superConfigurableTheme": "Super Configurable theme",
  "6pages": "6 Pages",
  "1weekWork": "1 Week Work",
  "onlineStoreSite": "Online Store Site",
  "1199Euro": "1199 Euro",
  "wordpressAndWoocommerceBuilt": "Wordpress & E-commerce Built",
  "200Products": "200 Products",
  "liveContactChat": "Live Contact Chat",
  "loginClientAccount": "Login Client Account",
  "4weeksWork": "4 Weeks Work",
  "recommendedPartners": "Recommended partners",
  "timoteiPerju": "Timotei Perju",
  "videoTranslating": "Video",
  "videoEditing": "Video Editing",
  "visualEffects": "Visual Effects",
  "contentCreator": "Content Creator",
  "customizationOptions": "Customization Options",
  "1to2wweeksWork": "1 - 2 weeks work",
  "posts": "Posts",
  "websiteContent": "Website Content",
  "socialMediaContent": "Social Media Content",
  "myWork": "My Work",
  "filterAll": "All",
  "presentationSite": "Presentation Site",
  "eStore": "E-Store",
  "contactMe": "Contact Me",
  "myAddress": "My Address",
  "oradeaAddress": "Oradea Bihor, Romania",
  "socialProfiles": "Social Profiles",
  "emailMe": "Email Me",
  "callMe": "Call Me",
  "portfolioDetails": "Portfolio Details",
  "mobileView": "Mobile View",
  "projectInformation": "Project Information",
  "categoryOnlineStoreBeautiq": "Category: Online Store Site",
  "platformWordpressBeautiq": "Platform: Wordpress & E-commerce",
  "projectDateJune2023Beautiq": "Project date: June, 2023",
  "beautiqProftolioDetails_0": "I am thrilled to share that I've successfully built the BeautiQ's e-commerce site! It has been an exciting journey, and I'd like to highlight some of the key accomplishments:",
  "beautiqProftolioDetails_1": "User-Centric Design: I've put considerable effort into creating a user-friendly interface. Navigating the site is simple and straightforward, ensuring a smooth experience for the valued customers on all devices.",
  "beautiqProftolioDetails_2": "Fast Checkout: I've streamlined the checkout process, making it quick and efficient with the tools that woo-commerce offers.",
  "beautiqProftolioDetails_3": "Full Customizable: I built the entire theme (Header / Footer / Modals etc) from scratch using Elementor Pro. In this way i've been able to build a unique design offering the posibility to my client to custmize every single pixel!.",
  "beautiqProftolioDetails_4": "Secure Payment: Integrated the shipping and payment procceses (API) using secured platforms.",
  "categoryOnlineStoreCaffeditalia": "Category: Online Store Site",
  "platformWordpressCaffeditalia": "Platform: Wordpress & E-commerce",
  "projectDateJune2023Caffeditalia": "Project date: May, 2023",
  "caffeditaliaProftolioDetails_0": " I'm excited to announce the successful launch of Caffe d'Italia. Here's an overview of the technical accomplishments:",
  "caffeditaliaProftolioDetails_1": "Secure Shopping: With the power of the woo-commerce i've made the platform secure enough for a smooth shopping.",
  "caffeditaliaProftolioDetails_2": "Promotions and Discounts:: Advanced algorithms track promotions and discounts in real-time, ensuring that the customers are always aware of cost-saving opportunities for their favorite coffee products.",
  "caffeditaliaProftolioDetails_3": "Full Customizable: I built the entire theme (Header / Footer / Modals etc) from scratch using Elementor Pro. In this way i've been able to build a unique design offering the posibility to my client to custmize every single pixel!.",
  "caffeditaliaProftolioDetails_4": "Elementor Pro: With the power of elementor pro, I integrated dozens of modern web UI components nad made the interface user-friendly.",
  "timofteRebeca": "Timofte Rebeca",
  "contentWriter": "Content Writer",
  "categoryOnlineStoreClaudiuSuciu": "Category: Presentation Site",
  "platformWordpressClaudiuSuciu": "Framework: Bootstrap",
  "projectDateJune2023ClaudiuSuciu": "Project date: September, 2023",
  "ClaudiuSuciuProftolioDetails_0": "Here's an overview of the technical accomplishments of Claudiu's Website:",
  "ClaudiuSuciuProftolioDetails_1": "Responsive Design: I ensured that the site is fully responsive, adapting to various screen sizes and devices. This ensures a consistent user experience across desktops, tablets, and mobile phones.",
  "ClaudiuSuciuProftolioDetails_2": "Bootstrap Framework: I utilized the Bootstrap framework to streamline the development process. This choice not only enhanced the site's appearance but also improved its performance and maintainability.",
  "ClaudiuSuciuProftolioDetails_3": "Social Media Links: I included social media icons and links, making it convenient for users to connect with the individual on various platforms.",
  "ClaudiuSuciuProftolioDetails_4": "Hosting and Domain Setup: I assisted in the domain registration and hosting setup, ensuring a seamless deployment process.",
  "servicesMaintenance": "Maintenance",
  "99EuroPerMonth": "99 Euro / month",
  "dailyUpdates": "Daily updates",
  "dailyBackups": "Daily Backups",
  "bugsOfAnyKind": "Bugs fix of any kind",
  "technicalFunctionalityOfSite": "Technical functionality of the site",
  "bugResolved24H": "24h Bug resolved"
}
